<!DOCTYPE html>
<html>
<body>
<div align="center">
<h3>Prepared by Asif Bhat</h3>
    
<h1>Pandas - Series & Dataframes</h1>

<h3>Follow Me on - <a href="https://www.linkedin.com/in/asif-bhat/">LinkedIn</a>&nbsp; <a href="https://mobile.twitter.com/_asifbhat_">Twitter</a>&nbsp; <a href="https://www.instagram.com/datasciencescoop/?hl=en">Instagram</a>&nbsp; <a href="https://www.facebook.com/datasciencescoop/">Facebook</a></h3>
</div>
</body>
</html>

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import glob
import re
import math

In [2]:
!pip install numpy

Requirement already satisfied: numpy in /Users/Optimus/opt/anaconda3/envs/env1/lib/python3.7/site-packages (1.18.2)

# Merge Dataframes

In [3]:
daf1 =  pd.DataFrame ({'id': ['1', '2', '3', '4', '5'], 'Name': ['Asif', 'Basit', 'Bran', 'John', 'David']})
daf1

  id   Name
0  1   Asif
1  2  Basit
2  3   Bran
3  4   John
4  5  David

In [4]:
daf2 =  pd.DataFrame ({'id': ['1', '2', '6', '7', '8'], 'Score': [40 , 60 , 80 , 90 , 70]})
daf2

  id  Score
0  1     40
1  2     60
2  6     80
3  7     90
4  8     70

In [5]:
# Inner Join
pd.merge(daf1, daf2, on='id', how='inner')

  id   Name  Score
0  1   Asif     40
1  2  Basit     60

In [6]:
# Full Outer Join
pd.merge(daf1, daf2, on='id', how='outer')

  id   Name  Score
0  1   Asif   40.0
1  2  Basit   60.0
2  3   Bran    NaN
3  4   John    NaN
4  5  David    NaN
5  6    NaN   80.0
6  7    NaN   90.0
7  8    NaN   70.0

In [7]:
# Left Outer Join
pd.merge(daf1, daf2, on='id', how='left')

  id   Name  Score
0  1   Asif   40.0
1  2  Basit   60.0
2  3   Bran    NaN
3  4   John    NaN
4  5  David    NaN

In [8]:
#Right Outer Join
pd.merge(daf1, daf2, on='id', how='right')

  id   Name  Score
0  1   Asif     40
1  2  Basit     60
2  6    NaN     80
3  7    NaN     90
4  8    NaN     70

# Importing multiple CSV files in DataFrame
> https://github.com/CSSEGISandData/COVID-19/tree/master/csse_covid_19_data/csse_covid_19_daily_reports

In [9]:
import pandas as pd

In [10]:
df = pd.read_csv('../../data/sample_covid19.csv') # for each root folder lever to reach we add "../""

In [11]:
df

,FIPS,Admin2,Province_State,Country_Region,Last_Update,Lat,Long_,Confirmed,Deaths,Recovered,Active,Combined_Key
0,45001.0,Abbeville,South Carolina,US,2020-05-17 02:32:32,34.223334,-82.461707,34,0,0,34,"Abbeville, South Carolina, US"
1,22001.0,Acadia,Louisiana,US,2020-05-17 02:32:32,30.295065,-92.414197,192,11,0,181,"Acadia, Louisiana, US"
2,51001.0,Accomack,Virginia,US,2020-05-17 02:32:32,37.767072,-75.632346,668,9,0,659,"Accomack, Virginia, US"
3,16001.0,Ada,Idaho,US,2020-05-17 02:32:32,43.452658,-116.241552,773,22,0,751,"Ada, Idaho, US"
4,19001.0,Adair,Iowa,US,2020-05-17 02:32:32,41.330756,-94.471059,4,0,0,4,"Adair, Iowa, US"
...,...,...,...,...,...,...,...,...,...,...,...,...
3299,NaN,NaN,NaN,West Bank and Gaza,2020-05-17 02:32:32,31.952200,35.233200,376,2,329,45,West Bank and Gaza
3300,NaN,NaN,NaN,Western Sahara,2020-05-17 02:32:32,24.215500,-12.885800,6,0,6,0,Western Sahara
3301,NaN,NaN,NaN,Yemen,2020-05-17 02:32:32,15.552727,48.516388,122,18,1,103,Yemen
3302,NaN,NaN,NaN,Zambia,2020-05-17 02:32:32,-13.133897,27.849332,679,7,183,489,Zambia
3303,NaN,NaN,NaN,Zimbabwe,2020-05-17 02:32:32,-19.015438,29.154857,42,4,13,25,Zimbabwe

In [12]:
# Append all CSV files 
path =r'../../data/'
filenames = glob.glob(path + "*.csv")
covid = pd.DataFrame()
for f in filenames:
    df = pd.read_csv(f)
    covid = covid.append(df,ignore_index=True,sort=True)

In [13]:
# Top 10 rows of the Dataframe
covid.head(5)

,#,Active,Admin2,Attack,Combined_Key,Confirmed,Country_Region,Deaths,Defense,FIPS,...,Long_,Name,Province_State,Recovered,Sp. Atk,Sp. Def,Speed,Total,Type 1,Type 2
0,1.0,NaN,NaN,49.0,NaN,NaN,NaN,NaN,49.0,NaN,...,NaN,Bulbasaur,NaN,NaN,65.0,65.0,45.0,318.0,Grass,Poison
1,2.0,NaN,NaN,62.0,NaN,NaN,NaN,NaN,63.0,NaN,...,NaN,Ivysaur,NaN,NaN,80.0,80.0,60.0,405.0,Grass,Poison
2,3.0,NaN,NaN,82.0,NaN,NaN,NaN,NaN,83.0,NaN,...,NaN,Venusaur,NaN,NaN,100.0,100.0,80.0,525.0,Grass,Poison
3,3.0,NaN,NaN,100.0,NaN,NaN,NaN,NaN,123.0,NaN,...,NaN,VenusaurMega Venusaur,NaN,NaN,122.0,120.0,80.0,625.0,Grass,Poison
4,4.0,NaN,NaN,52.0,NaN,NaN,NaN,NaN,43.0,NaN,...,NaN,Charmander,NaN,NaN,60.0,50.0,65.0,309.0,Fire,NaN

In [14]:
# Bottom 10 rows of the Dataframe
covid.tail(5)
covid.sample(10)
covid.shape

(4104, 25)

In [15]:
# Reading columns
covid['Country_Region'].value_counts() # .head(10)

US                        2985
China                       33
Italy                       21
Spain                       19
Germany                     17
                          ...
Bosnia and Herzegovina       1
Sri Lanka                    1
Slovenia                     1
Burkina Faso                 1
Panama                       1
Name: Country_Region, Length: 188, dtype: int64

In [16]:
# Reading columns
df1 = covid[['Last_Update', 'Country_Region' ,'Province_State','Confirmed']]
df1.head(10)
# df1.iloc
df1.iloc[[0,-1],[1,2]]
df1.iloc[[1,2,3],[1,2]]
df1.iloc[ 1,3 ]

nan

In [17]:
#Read specific rows 
df1.iloc[1:3]

  Last_Update Country_Region Province_State  Confirmed
1         NaN            NaN            NaN        NaN
2         NaN            NaN            NaN        NaN

In [18]:
#Filter data 
df1.loc[df1['Country_Region']== 'Germany']

              Last_Update Country_Region          Province_State  Confirmed
3787  2020-05-17 02:32:32        Germany       Baden-Wurttemberg    33912.0
3790  2020-05-17 02:32:32        Germany                  Bayern    45665.0
3792  2020-05-17 02:32:32        Germany                  Berlin     6443.0
3795  2020-05-17 02:32:32        Germany             Brandenburg     3197.0
3796  2020-05-17 02:32:32        Germany                  Bremen     1167.0
3834  2020-05-17 02:32:32        Germany                 Hamburg     5031.0
3838  2020-05-17 02:32:32        Germany                  Hessen     9261.0
3858  2020-05-17 02:32:32        Germany  Mecklenburg-Vorpommern      750.0
3868  2020-05-17 02:32:32        Germany           Niedersachsen    11147.0
3870  2020-05-17 02:32:32        Germany     Nordrhein-Westfalen    36134.0
3888  2020-05-17 02:32:32        Germany         Rheinland-Pfalz     6449.0
3889  2020-05-17 02:32:32        Germany                Saarland     2708.0
3890  2020-05-17 02:32:32        Germany                 Sachsen     5110.0
3891  2020-05-17 02:32:32        Germany          Sachsen-Anhalt     1676.0
3896  2020-05-17 02:32:32        Germany      Schleswig-Holstein     2998.0
3907  2020-05-17 02:32:32        Germany               Thuringen     2711.0
3913  2020-05-17 02:32:32        Germany                 Unknown     1393.0

In [19]:
display('This is heading for our dataframe','Abbas', df1.sort_values(['Country_Region'], ascending=False ).head(10))
'abbas'

'This is heading for our dataframe'

'Abbas'

              Last_Update      Country_Region Province_State  Confirmed
4103  2020-05-17 02:32:32            Zimbabwe            NaN       42.0
4102  2020-05-17 02:32:32              Zambia            NaN      679.0
4101  2020-05-17 02:32:32               Yemen            NaN      122.0
4100  2020-05-17 02:32:32      Western Sahara            NaN        6.0
4099  2020-05-17 02:32:32  West Bank and Gaza            NaN      376.0
4098  2020-05-17 02:32:32             Vietnam            NaN      318.0
4097  2020-05-17 02:32:32           Venezuela            NaN      504.0
4096  2020-05-17 02:32:32          Uzbekistan            NaN     2738.0
4095  2020-05-17 02:32:32             Uruguay            NaN      733.0
3793  2020-05-17 02:32:32      United Kingdom        Bermuda      123.0

'abbas'

In [20]:
#Sort Data Frame
display('Sorted Data Frame', df1.sort_values(['Country_Region'], ascending=True).head(5))

'Sorted Data Frame'

              Last_Update Country_Region Province_State  Confirmed
3923  2020-05-17 02:32:32    Afghanistan            NaN     6402.0
3924  2020-05-17 02:32:32        Albania            NaN      933.0
3925  2020-05-17 02:32:32        Algeria            NaN     6821.0
3926  2020-05-17 02:32:32        Andorra            NaN      761.0
3927  2020-05-17 02:32:32         Angola            NaN       48.0

In [21]:
#Sort Data Frame
display('Sorted Data Frame', df1.sort_values(['Country_Region'], ascending=False).head(5))

'Sorted Data Frame'

              Last_Update      Country_Region Province_State  Confirmed
4103  2020-05-17 02:32:32            Zimbabwe            NaN       42.0
4102  2020-05-17 02:32:32              Zambia            NaN      679.0
4101  2020-05-17 02:32:32               Yemen            NaN      122.0
4100  2020-05-17 02:32:32      Western Sahara            NaN        6.0
4099  2020-05-17 02:32:32  West Bank and Gaza            NaN      376.0

In [22]:
df1

              Last_Update      Country_Region Province_State  Confirmed
0                     NaN                 NaN            NaN        NaN
1                     NaN                 NaN            NaN        NaN
2                     NaN                 NaN            NaN        NaN
3                     NaN                 NaN            NaN        NaN
4                     NaN                 NaN            NaN        NaN
...                   ...                 ...            ...        ...
4099  2020-05-17 02:32:32  West Bank and Gaza            NaN      376.0
4100  2020-05-17 02:32:32      Western Sahara            NaN        6.0
4101  2020-05-17 02:32:32               Yemen            NaN      122.0
4102  2020-05-17 02:32:32              Zambia            NaN      679.0
4103  2020-05-17 02:32:32            Zimbabwe            NaN       42.0

[4104 rows x 4 columns]

In [23]:
#Sort Data Frame - Ascending on "Country" & descending on "Last update"
display('Sorted Data Frame', df1.sort_values(['Country_Region', 'Province_State'], ascending=[0,0]).head(5))

'Sorted Data Frame'

              Last_Update      Country_Region Province_State  Confirmed
4103  2020-05-17 02:32:32            Zimbabwe            NaN       42.0
4102  2020-05-17 02:32:32              Zambia            NaN      679.0
4101  2020-05-17 02:32:32               Yemen            NaN      122.0
4100  2020-05-17 02:32:32      Western Sahara            NaN        6.0
4099  2020-05-17 02:32:32  West Bank and Gaza            NaN      376.0

In [24]:
display('Sorted Data Frame', df1.sort_values(['Country_Region', 'Province_State'], ascending=[1,1])[df1['Country_Region']=='US'])

/Users/Optimus/opt/anaconda3/envs/env1/lib/python3.7/site-packages/ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

'Sorted Data Frame'

              Last_Update Country_Region Province_State  Confirmed
904   2020-05-17 02:32:32             US        Alabama      110.0
912   2020-05-17 02:32:32             US        Alabama      254.0
923   2020-05-17 02:32:32             US        Alabama       79.0
987   2020-05-17 02:32:32             US        Alabama       50.0
1004  2020-05-17 02:32:32             US        Alabama       45.0
...                   ...            ...            ...        ...
3355  2020-05-17 02:32:32             US        Wyoming       23.0
3388  2020-05-17 02:32:32             US        Wyoming      100.0
3448  2020-05-17 02:32:32             US        Wyoming       10.0
3500  2020-05-17 02:32:32             US        Wyoming        0.0
3594  2020-05-17 02:32:32             US        Wyoming        9.0

[2985 rows x 4 columns]

In [25]:
#Iterating through the dataset
for index , row in df1.iterrows():
    if (row['Country_Region'] == 'Indonesia' ):
        display(row[['Country_Region' ,'Confirmed']])

Country_Region    Indonesia
Confirmed             17025
Name: 3999, dtype: object

In [26]:
#Unique Values
covid['Country_Region'].drop_duplicates(keep='first').head(10)

0                  NaN
800                 US
3778             Italy
3779            Canada
3780             Spain
3781    United Kingdom
3782             China
3784       Netherlands
3786         Australia
3787           Germany
Name: Country_Region, dtype: object

In [27]:
# Countries impacted with Coronavirus
countries = covid['Country_Region'].unique()
type(countries) , countries

(numpy.ndarray,
 array([nan, 'US', 'Italy', 'Canada', 'Spain', 'United Kingdom', 'China',
        'Netherlands', 'Australia', 'Germany', 'Denmark', 'France',
        'Afghanistan', 'Albania', 'Algeria', 'Andorra', 'Angola',
        'Antigua and Barbuda', 'Argentina', 'Armenia', 'Austria',
        'Azerbaijan', 'Bahamas', 'Bahrain', 'Bangladesh', 'Barbados',
        'Belarus', 'Belgium', 'Belize', 'Benin', 'Bhutan', 'Bolivia',
        'Bosnia and Herzegovina', 'Botswana', 'Brazil', 'Brunei',
        'Bulgaria', 'Burkina Faso', 'Burma', 'Burundi', 'Cabo Verde',
        'Cambodia', 'Cameroon', 'Central African Republic', 'Chad',
        'Chile', 'Colombia', 'Comoros', 'Congo (Brazzaville)',
        'Congo (Kinshasa)', 'Costa Rica', "Cote d'Ivoire", 'Croatia',
        'Cuba', 'Cyprus', 'Czechia', 'Diamond Princess', 'Djibouti',
        'Dominica', 'Dominican Republic', 'Ecuador', 'Egypt',
        'El Salvador', 'Equatorial Guinea', 'Eritrea', 'Estonia',
        'Eswatini', 'Ethiopia', 'Fiji', 'Finland', 'Gabon', 'Gambia',
        'Georgia', 'Ghana', 'Greece', 'Grenada', 'Guatemala', 'Guinea',
        'Guinea-Bissau', 'Guyana', 'Haiti', 'Holy See', 'Honduras',
        'Hungary', 'Iceland', 'India', 'Indonesia', 'Iran', 'Iraq',
        'Ireland', 'Israel', 'Jamaica', 'Japan', 'Jordan', 'Kazakhstan',
        'Kenya', 'Korea, South', 'Kosovo', 'Kuwait', 'Kyrgyzstan', 'Laos',
        'Latvia', 'Lebanon', 'Lesotho', 'Liberia', 'Libya',
        'Liechtenstein', 'Lithuania', 'Luxembourg', 'MS Zaandam',
        'Madagascar', 'Malawi', 'Malaysia', 'Maldives', 'Mali', 'Malta',
        'Mauritania', 'Mauritius', 'Mexico', 'Moldova', 'Monaco',
        'Mongolia', 'Montenegro', 'Morocco', 'Mozambique', 'Namibia',
        'Nepal', 'New Zealand', 'Nicaragua', 'Niger', 'Nigeria',
        'North Macedonia', 'Norway', 'Oman', 'Pakistan', 'Panama',
        'Papua New Guinea', 'Paraguay', 'Peru', 'Philippines', 'Poland',
        'Portugal', 'Qatar', 'Romania', 'Russia', 'Rwanda',
        'Saint Kitts and Nevis', 'Saint Lucia',
        'Saint Vincent and the Grenadines', 'San Marino',
        'Sao Tome and Principe', 'Saudi Arabia', 'Senegal', 'Serbia',
        'Seychelles', 'Sierra Leone', 'Singapore', 'Slovakia', 'Slovenia',
        'Somalia', 'South Africa', 'South Sudan', 'Sri Lanka', 'Sudan',
        'Suriname', 'Sweden', 'Switzerland', 'Syria', 'Taiwan*',
        'Tajikistan', 'Tanzania', 'Thailand', 'Timor-Leste', 'Togo',
        'Trinidad and Tobago', 'Tunisia', 'Turkey', 'Uganda', 'Ukraine',
        'United Arab Emirates', 'Uruguay', 'Uzbekistan', 'Venezuela',
        'Vietnam', 'West Bank and Gaza', 'Western Sahara', 'Yemen',
        'Zambia', 'Zimbabwe'], dtype=object))

In [28]:
df2 = pd.read_csv('../../data/Pokemon.csv')
df2.head(5)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,625,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,309,39,52,43,60,50,65,1,False

In [29]:
# Sum of Columns 
df2['Total'] = df2['HP'] + df2['Attack']
df2.head(5)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,94,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,122,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,162,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,180,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,91,39,52,43,60,50,65,1,False

In [30]:
# Sum of Columns 
df2['Total'] = df2.iloc[:,4:10].sum(axis=1)
df2.head(5)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,367,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,467,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,607,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,725,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,335,39,52,43,60,50,65,1,False

In [31]:
#Shifting "Total" column

cols = list(df2.columns)

df2 = df2[cols[0:10] + [cols[-1]] + cols[10:12]]
df2.head(5)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Legendary,Speed,Generation
0,1,Bulbasaur,Grass,Poison,367,45,49,49,65,65,False,45,1
1,2,Ivysaur,Grass,Poison,467,60,62,63,80,80,False,60,1
2,3,Venusaur,Grass,Poison,607,80,82,83,100,100,False,80,1
3,3,VenusaurMega Venusaur,Grass,Poison,725,80,100,123,122,120,False,80,1
4,4,Charmander,Fire,NaN,335,39,52,43,60,50,False,65,1

In [32]:
#Shifting "Legendary" column -  Index location -1 or 12

cols = list(df2.columns)

df2 = df2[cols[0:10] + [cols[-1]] + cols[10:12]]
df2.head(5)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Generation,Legendary,Speed
0,1,Bulbasaur,Grass,Poison,367,45,49,49,65,65,1,False,45
1,2,Ivysaur,Grass,Poison,467,60,62,63,80,80,1,False,60
2,3,Venusaur,Grass,Poison,607,80,82,83,100,100,1,False,80
3,3,VenusaurMega Venusaur,Grass,Poison,725,80,100,123,122,120,1,False,80
4,4,Charmander,Fire,NaN,335,39,52,43,60,50,1,False,65

In [33]:
#Shifting "Generation" column - Index location -1 or 12

cols = list(df2.columns)

df2 = df2[cols[0:10] + [cols[12]] + cols[10:12]]
df2.head(5)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,367,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,467,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,607,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,725,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,335,39,52,43,60,50,65,1,False

In [34]:
#Save to CSV file

df2.to_csv('poke_updated.csv')

In [35]:
#Save to CSV file without index column

df2.to_csv('poke_updated1.csv', index=False)

In [36]:
df2.head(10)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,367,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,467,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,607,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,725,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,335,39,52,43,60,50,65,1,False
5,5,Charmeleon,Fire,NaN,447,58,64,58,80,65,80,1,False
6,6,Charizard,Fire,Flying,596,78,84,78,109,85,100,1,False
7,6,CharizardMega Charizard X,Fire,Dragon,742,78,130,111,130,85,100,1,False
8,6,CharizardMega Charizard Y,Fire,Flying,716,78,104,78,159,115,100,1,False
9,7,Squirtle,Water,NaN,363,44,48,65,50,64,43,1,False

In [37]:
# Save Dataframe as text file
df2.to_csv('poke.txt' , sep='\t' , index=False)

In [38]:
# Save Dataframe as xlsx file
df2.to_excel('poke.xlsx')

ModuleNotFoundError: No module named 'openpyxl'

In [ ]:
# Save Dataframe as xlsx file without row names
df2.to_excel('poke.xlsx', index=0)

In [ ]:
#Filtering using loc

df2.loc[df2['Type 2'] == 'Dragon']

In [ ]:
#Filtering using loc
df3 = df2.loc[(df2['Type 2'] == 'Dragon') & (df2['Type 1'] == 'Dark')]
df3

In [ ]:
#Reset index for Dataframe df3 keeping old index column

df4 = df3.reset_index()
df4

In [ ]:
#Reset index for Dataframe df3 removing old index column

df3.reset_index(drop=True , inplace=True)
df3

In [ ]:
df2.head(10)

# LIKE OPERATION IN PANDAS

In [ ]:
df2.Name.str.contains("rill").head(10)

In [ ]:
# Display all rows containing Name "rill"
df2.loc[df2.Name.str.contains("rill")]

In [ ]:
# Exclude all rows containing "rill"
df2.loc[~df2.Name.str.contains("rill")].head(10)

In [ ]:
#Display all rows with Type-1 as "Grass" and Type-2 as "Poison"

df2.loc[df2['Type 1'].str.contains("Grass") & df2['Type 2'].str.contains("Poison")]

In [ ]:
df2.loc[df2['Type 1'].str.contains('Grass|Water',regex = True)].head(10)

In [ ]:
# Due to Case-sensitive it will not return any data

df2.loc[df2['Type 1'].str.contains('grass|water',regex = True)].head(10)

In [ ]:
# To ignore case we can use "case = False"

df2.loc[df2['Type 1'].str.contains('grass|water', case = False ,regex = True)].head(10)

In [ ]:
# To ignore case we can use "Flags = re.I"

df2.loc[df2['Type 1'].str.contains('grass|water',flags = re.I ,regex = True)].head(10)

# Regex in Pandas dataframe

In [ ]:
#Get all rows with name starting with "wa"

df2.loc[df2.Name.str.contains('^Wa',flags = re.I ,regex = True)].head(10)

In [ ]:
#Get all rows with name starting with "wa" followed by any letter between a-l

df2.loc[df2.Name.str.contains('^Wa[a-l]+',flags = re.I ,regex = True)].head(10)

In [ ]:
#Get all rows with name starting with x , y, z

df2.loc[df2.Name.str.contains('^[x-z]',flags = re.I ,regex = True)]

In [ ]:
# Extracting first 3 characters from "Name" column
df2['Name2'] = df2.Name.str.extract(r'(^\w{3})')

In [ ]:
df2.head(5)

In [ ]:
# Return all rows with "Name" starting with character 'B or b' 
df2.loc[df2.Name.str.match(r'(^[B|b].*)')].head(5)

# Replace values in dataframe

In [ ]:
df2.head(10)

In [ ]:
df2['Type 1'] = df2['Type 1'].replace({"Grass" : "Meadow" , "Fire" :"Blaze"})

In [ ]:
df2.head(10)

In [ ]:
df2['Type 2'] = df2['Type 2'].replace({"Poison" : "Venom"})

In [ ]:
df2.head(5)

In [ ]:
df2['Type 2'] = df2['Type 2'].replace(['Venom' , 'Dragon'] , 'DANGER')

In [ ]:
df2.head(10)

In [ ]:
df2.loc[df2['Type 2'] == 'DANGER' , 'Name2'] = np.NaN

In [ ]:
df2.head(10)

In [ ]:
df2.loc[df2['Total'] > 400 , ['Name2' , 'Legendary']] = 'ALERT'
df2.head(10)

In [ ]:
df2.loc[df2['Total'] > 400 , ['Legendary' , 'Name2']] = ['ALERT-1' , 'ALERT-2'] 
df2.head(10)

# Group By

In [ ]:
df = pd.read_csv('poke_updated1.csv')
df.head(5)

In [ ]:
df.groupby(['Type 1']).mean().head(10)

In [ ]:
df.groupby(['Type 1']).mean().sort_values('Attack' , ascending = False).head(10)

In [ ]:
df.groupby(['Type 1']).mean().sort_values('Defense' , ascending = False).head(10)

In [ ]:
df.groupby(['Type 1']).mean().sort_values('Speed' , ascending = False).head(10)

In [ ]:
df.sum()

In [ ]:
df.groupby(['Type 2']).sum().head(5)

In [ ]:
df.count()

In [ ]:
df['count1'] = 0
df.groupby(['Type 2']).count()['count1']

In [ ]:
df['count1'] = 0
df.groupby(['Type 1']).count()['count1']

In [ ]:
df['count1'] = 0
df.groupby(['Type 1' , 'Type 2' , 'Legendary']).count()['count1']

# Loading Data in Chunks

In [ ]:
for df in pd.read_csv('poke_updated1.csv', chunksize=10):
    print(df)

In [ ]:
df

In [ ]:
df1 = pd.DataFrame()
for df in pd.read_csv('poke_updated1.csv', chunksize=10):
    df1 = pd.concat([df1 ,df])
df1.head(15)

# Stack & unstack in Pandas

In [ ]:
col = pd.MultiIndex.from_product([['2010','2015'],['Literacy' , 'GDP']])

data =([[80,7,88,6],[90,8,92,7],[89,7,91,8],[87,6,93,8]])

df6 = pd.DataFrame(data, index=['India','USA' , 'Russia' , 'China'], columns=col)
df6

In [ ]:
# Stack() Function stacks the columns to rows.
st_df = df6.stack()
st_df

In [ ]:
#Unstacks the row to columns
unst_df = st_df.unstack()
unst_df

In [ ]:
unst_df = unst_df.unstack()
unst_df

In [ ]:
unst_df = unst_df.unstack()
unst_df

# PIVOT Tables

In [ ]:
data = {
    'Country':['India','USA' , 'Russia' , 'China','India','USA' , 'Russia' , 'China','India','USA' , 'Russia' , 'China','India','USA' , 'Russia' , 'China'],
    'Year':['2010','2010','2010','2010' , '2010','2010','2010','2010','2015','2015','2015','2015','2015','2015','2015','2015'],
     
    'Literacy/GDP':['GDP' , 'GDP' , 'GDP' , 'GDP','Literacy' , 'Literacy', 'Literacy' , 'Literacy','GDP' , 'GDP','GDP' , 'GDP','Literacy' , 'Literacy','Literacy' , 'Literacy'],
   'Value':[7,8,7,6,80,90,89,87,6,7,8, 8, 88 , 92 , 91 ,93]}
 
df7 = pd.DataFrame(data,columns=['Country','Year','Literacy/GDP','Value'])
df7

In [ ]:
# Pivot table with SUM aggregation
pd.pivot_table(df7 , index= ['Year' , 'Literacy/GDP'] , aggfunc='sum')

In [ ]:
# Pivot table with MEAN aggregation
pd.pivot_table(df7 , index= ['Year' , 'Literacy/GDP'] , aggfunc='mean')

# Hierarchical indexing

In [ ]:
df7

In [ ]:
df8=df7.set_index(['Year', 'Literacy/GDP'])
df8

In [ ]:
df8.index

In [ ]:
df8.loc['2010']

In [ ]:
df8.loc[['2010']]

In [ ]:
df8.loc['2015','Literacy']

In [ ]:
df8.loc['2015','Literacy']

In [ ]:
df8=df7.set_index(['Year', 'Literacy/GDP' , 'Country'])
df8

### SWAP Columns in Hierarchical indexing

In [ ]:
df7

In [ ]:
df8=df7.set_index(['Year', 'Literacy/GDP'])
df8

In [ ]:
# Swaping the columns in Hierarchical index
df9 = df8.swaplevel('Year', 'Literacy/GDP')
df9

In [ ]:
# Swaping the columns in Hierarchical index
df9 = df9.swaplevel('Year', 'Literacy/GDP')
df9

# Crosstab in Pandas

In [ ]:
df7

In [ ]:
pd.crosstab(df7['Literacy/GDP'] , df7.Value , margins=True)

In [ ]:
# 2 way cross table
pd.crosstab(df7.Year , df7['Literacy/GDP'] , margins=True)

In [ ]:
# 3 way cross table
pd.crosstab([df7.Year , df7['Literacy/GDP']] , df7.Country, margins=True)

# Row & Column Bind

### Row Bind

In [ ]:
df8 = pd.DataFrame({'ID' :[1,2,3,4] ,  'Name' :['Asif' , 'Basit' , 'Ross' , 'John'] , 'Score' :[99 , 66 , 44 , 33]})
df8

In [ ]:
df9 = pd.DataFrame({'ID' :[5,6,7,8] ,  'Name' :['Michelle' , 'Ramiro' , 'Vignesh' , 'Damon'] , 'Score' :[78 , 54 , 77 , 87]})
df9

In [ ]:
# Row Bind with concat() function
pd.concat([df8 , df9])

In [ ]:
# Row Bind with append() function
df8.append(df9)

### Column Bind

In [ ]:
df10 = pd.DataFrame({'ID' :[1,2,3,4] , 'Name' :['Asif' , 'Basit' , 'Ross' , 'John']})
df10

In [ ]:
df11 = pd.DataFrame({'Age' :[20,30,35,40] , 'Score' :[99 , 66 , 44 , 33]})
df11

In [ ]:
pd.concat([df10,df11] , axis = 1)